app/views/users/show.html.erb


      <% if @user.organizations.any? %>
---
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."user_id" = 1