app/views/shared/_organization_profile.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "1"]]
---

  <%= form_for(current_user.organizations.find(params[:id])),
               html: { method: :delete },
               remote: true) do |f| %>