app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations" WHERE (name ILIKE '%ngo%')
---
  def search
    @name = params[:name]
    @results = Organization.search(@name)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @organization = Organization.find(params[:id])

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @title = "Edit Profile"
    @organization = Organization.find(params[:id])

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "organizations" SET "googleplus" = 'nil', "updated_at" = '2014-06-03 20:21:39.349585' WHERE "organizations"."id" = 1
---
  def update
    @organization = Organization.find(params[:id])
    @organization = OrganizationsHelper.encode(@organization)
    if @organization.update_attributes(params[:organization])

INSERT INTO "organizations" ("address", "created_at", "donate", "facebook", "googleplus", "instagram", "join", "linkedin", "name", "related", "twitter", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @organization = current_user.organizations.build(params[:organization])
    @organization = OrganizationsHelper.encode(@organization)


    if @organization.save