app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."user_id" = 1 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    # @microposts = @user.microposts.paginate(page: params[:page])
    @organizations = @user.organizations.paginate(page: params[:page])